NextFOAM-2405/tutorials/incompressible/pisoFoam/LES/pitzDailyMapped/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type                mapped;
        value               uniform 2e-05;
        interpolationScheme cell;
        setAverage          false;
        average             2e-05;
    }

    outlet
    {
        type                inletOutlet;
        inletValue          uniform 0;
        value               uniform 0;
    }

    upperWall
    {
        type                fixedValue;
        value               uniform 0;
    }

    lowerWall
    {
        type                fixedValue;
        value               uniform 0;
    }

    frontAndBack
    {
        type                empty;
    }
}


// ************************************************************************* //
